Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile
The IFC2X3_ParametricObject_UShapeProfile class contains the U-shape profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile.Depth
The depth.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile.FlangeWidth
The flange width.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile.WebThickness
The web thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile.FlangeThickness
The flange thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile.FilletRadius
The fillet radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile.EdgeRadius
The edge radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_UShapeProfile.FlangeSlope
The flange slope.